code/openfoam/test/Lagrangian/bubbles/constant/Lagrangian/bubbles/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/Lagrangian/bubbles";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         multicomponentMixture;
    transport       const;
    thermo          eConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

species (O2 N2);

defaultSpecie N2;

mixture
{
    specie
    {
        molWeight   28.828828828828826;
    }
    thermodynamics
    {
        Cv          721.00561;
    }
}

O2
{
    specie
    {
        molWeight   32;
    }
    thermodynamics
    {
        Cv          649.555;
        hf          0;
    }
    transport
    {
        mu          1.84e-05;
        Pr          0.7;
    }
}

N2
{
    specie
    {
        molWeight   28;
    }
    thermodynamics
    {
        Cv          742.348;
        hf          0;
    }
    transport
    {
        mu          1.84e-05;
        Pr          0.7;
    }
}

pressure
{
    type        LaplacePressure;
    sigma       0.07 [N/m];
}


// ************************************************************************* //
