code/openfoam/test/Lagrangian/bubbles/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

bubblesMass
{
    type        cloudMass;
    libs        ("libLagrangianCloudFunctionObjects.so");
    cloud       bubbles;
    writeControl writeTime;
}

bubblesPlot
{
    type        LagrangianFieldValue;
    libs        ("libLagrangianFunctionObjects.so");
    Lagrangian  bubbles;
    fields      (m d p T);
    operation   average;
}

// ************************************************************************* //
